app/controllers/employees_controller.rb

  def index
    render json: Employee.all
---
SELECT "employees".* FROM "employees"

  def create
    employee = Employee.new(employee_params)
    if employee.save
---
INSERT INTO "employees" ("full_name", "job_title", "country", "salary", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["full_name", "Deepa Verma"], ["job_title", "Engineer"], ["country", "India"], ["salary", 50000.0], ["created_at", "2026-03-25 13:18:51.908501"], ["updated_at", "2026-03-25 13:18:51.908501"]]

  def update
    if @employee.update(employee_params)
---
UPDATE "employees" SET "full_name" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["full_name", "Deepa Verma"], ["updated_at", "2026-03-25 13:18:51.940861"], ["id", 1]]